{
    "title":"What is HTML?",
    "description":"<h2 id=\"whathtml\"><a href=\"https:\/\/www.w3.org\/html\/\">HTML<\/a>&nbsp;(the Hypertext Markup Language) and&nbsp;<a href=\"https:\/\/www.w3.org\/Style\/CSS\/\">CSS<\/a>&nbsp;(Cascading Style Sheets) are two of the core technologies for building Web pages. HTML provides the&nbsp;<em>structure<\/em>&nbsp;of the page, CSS the (visual and aural)&nbsp;<em>layout,<\/em>&nbsp;for a variety of devices. Along with&nbsp;<a href=\"https:\/\/www.w3.org\/standards\/webdesign\/graphics\">graphics<\/a>&nbsp;and&nbsp;<a href=\"https:\/\/www.w3.org\/standards\/webdesign\/script\">scripting<\/a>, HTML and CSS are the basis of building Web pages and&nbsp;Web Applications. Learn more below about:<\/h2>  ",
    "content":"<h2 id=\"whathtml\">What is HTML?<\/h2><p><a href=\"https:\/\/www.w3.org\/html\/\">HTML<\/a>&nbsp;is the language for describing the structure of Web pages. HTML gives authors the means to:<\/p><ul class=\"show_items\"><li>Publish online documents with headings, text, tables, lists, photos, etc.<\/li><li>Retrieve online information via hypertext links, at the click of a button.<\/li><li>Design forms for conducting transactions with remote services, for use in searching for information, making reservations, ordering products, etc.<\/li><li>Include spread-sheets, video clips, sound clips, and other applications directly in their documents.<\/li><\/ul><p>With HTML, authors describe the structure of pages using&nbsp;<em>markup.<\/em>&nbsp;The&nbsp;<em>elements<\/em>&nbsp;of the language label pieces of content such as &ldquo;paragraph,&rdquo; &ldquo;list,&rdquo; &ldquo;table,&rdquo; and so on.<\/p><h3>What is XHTML?<\/h3><p>XHTML is a variant of HTML that uses the syntax of&nbsp;<a href=\"https:\/\/www.w3.org\/standards\/xml\/core\">XML<\/a>, the Extensible Markup Language. XHTML has all the same elements (for paragraphs, etc.) as the HTML variant, but the syntax is slightly different. Because XHTML is an XML application, you can use other XML tools with it (such as&nbsp;<a href=\"https:\/\/www.w3.org\/standards\/xml\/transformation\">XSLT,<\/a>&nbsp;a language for transforming XML content).<\/p>",
    "metadesc":"HTML (the Hypertext Markup Language) and CSS (Cascading Style Sheets) are two of the core technologies for building Web pages.",
    "author":"Aarti Jakhar",
    "slug":"what-is-HTML"
}